Repository: vyra-entity/vyra_base_python
Catalog: docs/locale/*/LC_MESSAGES/core.po
Languages: de

source: Core Components
de: Kern-Komponenten

source: The Core module forms the heart of the VYRA framework. All central components are initialized and managed here.
de: Das Core-Modul bildet das Herz des VYRA-Frameworks. Hier werden alle zentralen Komponenten initialisiert und verwaltet.

source: Overview
de: Überblick

source: The Core module consists of three main components:
de: Das Core-Modul besteht aus drei Hauptkomponenten:

source: **Entity**: Central management unit for modules
de: **Entity**: Zentrale Verwaltungseinheit für Module

source: **Parameter**: Persistent configuration data in SQLite
de: **Parameter**: Persistente Konfigurationsdaten in SQLite

source: **Volatile**: Volatile, fast data storage with Redis
de: **Volatile**: Flüchtiger, schneller Datenspeicher mit Redis

source: Component Interaction
de: Komponenten-Interaktion

source: The three components work closely together:
de: Die drei Komponenten arbeiten eng zusammen:

source: **VyraEntity** initializes and orchestrates all module components
de: **VyraEntity** initialisiert und orchestriert alle Modulkomponenten

source: **Parameter** manages persistent configurations (slow, permanent)
de: **Parameter** verwaltet persistente Konfigurationen (langsam, permanent)

source: **Volatile** manages volatile real-time data (fast, temporary)
de: **Volatile** verwaltet flüchtige Echtzeitdaten (schnell, temporär)

source: Use Parameter for configuration data that should persist between restarts. Use Volatiles for real-time data and fast caching.
de: Verwenden Sie Parameter für Konfigurationsdaten, die zwischen Neustarts erhalten bleiben sollen. Verwenden Sie Volatiles für Echtzeitdaten und schnelles Caching.

source: Further Information
de: Weitere Informationen

source: :doc:`core/entity` - Central Entity Management
de: :doc:`core/entity` - Zentrale Entity-Verwaltung

source: :doc:`core/parameter` - Persistent Parameters
de: :doc:`core/parameter` - Persistente Parameter

source: :doc:`core/volatile` - Volatile Data
de: :doc:`core/volatile` - Flüchtige Daten

source: :doc:`vyra_base.core` - API Reference (auto-generated)
de: :doc:`vyra_base.core` - API-Referenz (automatisch generiert)
